@echo off
@echo *******************************************************************************
@echo *                七匣子安卓网（http://www.7xz.com）                           *
@echo *                                                                             *
@echo *                 天语V8第三方recovery刷入工具包                              *
@echo *                                                                             *
@echo * 1、手机在关机状态下长按音量上键+关机键，绿屏后松手，进入AP模式              *
@echo * 2、通过USB线连接手机与电脑（首次使用请先安装驱动），电脑上按任意键继续…    *
@echo *                                                                             *
@echo *******************************************************************************
@pause>nul
nvflash --bl bootloader.bin --download 8 recovery.img
@echo.
@echo **********************************************************************************
@echo *  第三方recovery刷入成功，手机长按关机键不动（6-8秒）退出AP模式重开机!          *
@echo *  进入recovery方法：手机长按开机键的同时按住音量上键，手机显示绿屏后松开电源    *
@echo *  键(保持按住上音量键)，直至手机显示蓝屏时再松开音量上键，手机会进入recovery模式*
@echo **********************************************************************************
@pause
